{"name":"data-society_horse-racing-tipster-bets","title":"Horse Racing - Tipster Bets","description":"Thirty nine thousand bets from thirty one tipsters.\n\nThe traditional approach in attempting to make a profit from horse-racing, using machine learning techniques, is to use systems involving dozens and dozens of variables. These systems include the following types of variables:\n\nHorse - Name, Sex, Age, Pedigree, Weight, Speed over various distances, race data with finishing times and positions - etc. Trainer info. Jockey info. Track info - Track, track conditions - etc.\n\nAnd a whole lot more.\n\nFinding, compiling, maintaining and updating this data is a massive task for the individual. Unless you have access to a database of such data - where would you even start?\n\nHow about a different approach.\n\nThe tipsters use their skill to study the horses and make a prediction - that they think a particular horse will win a particular race. We take those tipsters predictions and put them through a machine learning algorithm (microsoft azure) asking it to predict a 'win' or 'lose' based upon the tipsters performance history.\n\nQuestions\n\nAre bets from inactive tipsters critical to performance?\nIs it better to have all the tipsters 'stacked on top of each other' in one large dataset or is the system better served by separating them out?\nPredicting Bets\n\nWhen we ask the system to predict if a bet will Win or Lose for say Tipster A - we take the last ID number for that Tipster and add one to it - making it a new ID - outside the systems experience. That ID is used for all that Tipsters bets until the system is updated. The system is updated once a week.\n\n   * UID - Unique ID. Not used in the actual system. The dataset is housed in an access database - the UID keeps all the bets in order. You may find a use for it!\n   * ID - Each tipsters bets are kept in date and time order with the ID being incremented for each new bet, for each tipster.\n   * Tipster - The name of the tipster. Each tipsters bets are in order, followed by the next tipsters bets\n   * Date - The date of the race. Previous experiments showed, to us anyway, that the date was not important, that it was the ID number that showed the system that each tipsters bets are a linear list. The date is still used as it has never been shown to affect results in a negative way.\n   * Track - The name of the track. Some tipsters favour some tracks more than others and this affects their profit margin.\n   * Horse - The name of the horse.\n   * Bet Type - Is the bet a 'Win' bet or an 'Each Way' bet.\n   * Odds - The odds that the tipster presenting the bet say they got for the bet. When you actually place a bet you rarely get the predicted odds. Would the system be better served by lowering the odds by 10% to 20% which would be more realistic?\n   * Result - Did the bet Win or Lose.\n   * Tipster Active - Is the tipster active - true or false\n\nSource: Kaggle\n\nhttps://www.kaggle.com/gunner38/horseracing","homepage":"https://data.world/data-society/horse-racing-tipster-bets","resources":[{"name":"tips","schema":{"fields":[{"name":"uid","title":"UID","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"uid"},{"name":"id","title":"ID","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"id"},{"name":"tipster","title":"Tipster","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"tipster"},{"name":"date","title":"Date","type":"date","rdfType":"http://www.w3.org/2001/XMLSchema#date","dwSourceId":"date"},{"name":"track","title":"Track","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"track"},{"name":"horse","title":"Horse","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"horse"},{"name":"bet_type","title":"Bet Type","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"bet_type"},{"name":"odds","title":"Odds","type":"number","rdfType":"http://www.w3.org/2001/XMLSchema#decimal","dwSourceId":"odds"},{"name":"result","title":"Result","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"result"},{"name":"tipsteractive","title":"TipsterActive","type":"boolean","rdfType":"http://www.w3.org/2001/XMLSchema#boolean","dwSourceId":"tipsteractive"}]},"path":"data/tips.csv","format":"csv"},{"name":"original/tips.csv","path":"original/tips.csv","format":"csv","mediatype":"text/csv","bytes":2746034}],"keywords":["data society","horse racing","tipster","machine learning","classification"]}